backend/app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes"
---
    def index
        notes = Note.all

SELECT "notes".* FROM "notes" WHERE (2) LIMIT ?  [["LIMIT", 1]]
---
    def show
        note = Note.find_by(params[:id])